const questions = [
  {
    question: "Q.電話番号(090等)は必要ですか？",
    options: ["必要", "不要"],
    nextQ: ["Q.ご利用になるSIMの形状を教えてください", "Q.SMSを使いますか？"],
  },
  {
    question: "Q.ご利用になるSIMの形状を教えてください",
    options: ["SIMカード", "eSIM"],
    nextQ: ["Q.通話定額を使いますか？", "Q.通話定額を使いますか？"],
  },
  {
    question: "Q.SMSを使いますか？",
    options: ["SMSを使う", "SMSを使わない"],
    nextQ: [
      "Q.データ通信は毎月どのくらいご利用ですか？",
      "Q.データeSIMを使いますか？",
    ],
  },
  {
    question: "Q.通話定額を使いますか？",
    options: ["通話定額5分", "通話定額10分", "かけ放題＋", "使わない"],
    nextQ: [
      "Q.データ通信は毎月どのくらいご利用ですか？",
      "Q.データ通信は毎月どのくらいご利用ですか？",
      "Q.データ通信は毎月どのくらいご利用ですか？",
      "Q.データ通信は毎月どのくらいご利用ですか？",
    ],
  },
  {
    question: "Q.データeSIMを使いますか？",
    options: ["使う", "使わない"],
    nextQ: [
      "Q.データ通信は毎月どのくらいご利用ですか？",
      "Q.データ通信は毎月どのくらいご利用ですか？",
    ],
  },
  {
    question: "Q.データ通信は毎月どのくらいご利用ですか？",
    options: [
      "2ギガ",
      "5ギガ",
      "10ギガ",
      "15ギガ",
      "20ギガ",
      "30ギガ",
      "40ギガ",
      "50ギガ",
    ],
    nextQ: null,
  },
];
export default questions;
